In [1]:
import pandas as pd

In [2]:
# Creating a sample Dataframe

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 35],
    'Salary': [50000, 40000, 45000, 70000]
}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   40000
2  Charlie   22   45000
3    David   35   70000

In [3]:
df.sort_values(by='Age')

      Name  Age  Salary
2  Charlie   22   45000
0    Alice   25   50000
1      Bob   30   40000
3    David   35   70000

In [4]:
df.sort_values(by='Age', ascending=False)

      Name  Age  Salary
3    David   35   70000
1      Bob   30   40000
0    Alice   25   50000
2  Charlie   22   45000

In [6]:
sorted_df = df.sort_values(by=['Age', 'Salary'], ascending=[True, False])

In [7]:
sorted_df

      Name  Age  Salary
2  Charlie   22   45000
0    Alice   25   50000
1      Bob   30   40000
3    David   35   70000

In [8]:
sorted_df.sort_index()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   40000
2  Charlie   22   45000
3    David   35   70000

In [9]:
sorted_df.sort_index(ascending=False)

      Name  Age  Salary
3    David   35   70000
2  Charlie   22   45000
1      Bob   30   40000
0    Alice   25   50000

In [10]:
sorted_df.sort_index(ascending=False, inplace=True)

In [11]:
sorted_df

      Name  Age  Salary
3    David   35   70000
2  Charlie   22   45000
1      Bob   30   40000
0    Alice   25   50000

In [24]:
t1 = (('X', 1), ('X', 2), ('Y', 1), ('Y', 2))
n1 = ['group', 'subgroup']
data2 = {'PW': [3, 1, 4, 2], 'PWIOI': [9, 7, 6, 8]}

index = pd.MultiIndex.from_tuples(t1, names = n1)
index

MultiIndex([('X', 1),
            ('X', 2),
            ('Y', 1),
            ('Y', 2)],
           names=['group', 'subgroup'])

In [25]:
df2 = pd.DataFrame(data2, index=index)

In [26]:
df2

                PW  PWIOI
group subgroup
X     1          3      9
      2          1      7
Y     1          4      6
      2          2      8

In [27]:
df2.index

MultiIndex([('X', 1),
            ('X', 2),
            ('Y', 1),
            ('Y', 2)],
           names=['group', 'subgroup'])

In [28]:
df2.sort_index(level=['group', 'subgroup'])

                PW  PWIOI
group subgroup
X     1          3      9
      2          1      7
Y     1          4      6
      2          2      8

In [29]:
df2.sort_index(level=['group', 'subgroup'], ascending=False)

                PW  PWIOI
group subgroup
Y     2          2      8
      1          4      6
X     2          1      7
      1          3      9